Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །བདུག་པའི་རྒྱལ་པོ་འདིས་སྡུག་བསྔལ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་ཅིང་།
en: This king of incense will bring an end to all suffering.

source: དམྱལ་བ་ཐམས་ཅད་དང་སྡིག་པ་དང་འཇིགས་པ་ཐམས་ཅད་ལས་གྲོལ་ཏེ། ས་བཅུ་པོ་ཐོབ་ཅིང་བདེ་འགྲོའི་ལམ་བཟང་པོ་བསྟན་པ་དེའི་ཕྱིར་འབད་པ་ཐམས་ཅད་ཀྱིས་བདུག་པའི་རྒྱལ་པོ་འདི་སྦྱར་བར་བྱའོ།
en: It will liberate all denizens of hell, free them from all wickedness and fear, and establish them on the tenth bodhisattva level of the divine path as explained by the Sugata. One should therefore employ the king of incense with every effort and care.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བདུག་པ་ཆེན་པོའི་རྒྱལ་པོ་ཆེན་པོ་ཆོ་ག་ཞིབ་མོ་དང་རྗེས་སུ་མཐུན་པ་འདི་གསུངས་སོ།
en: The noble bodhisattva Avalokiteśvara, the great being, continued to teach the great rites of the great king of incense as follows. “

source: །འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར། མཆོད་རྟེན་ལ་སའི་ཕྱོགས་གང་དུ་བདུག་པ་འདིས་བདུག་པ་བྱ་སྟེ།
en: Any place on earth where this incense is burned in front of the Lord of the World becomes like a reliquary.

source: དེ་བཞིན་གཤེགས་པའི་གནས་རྟག་ཏུ་བྱིན་གྱིས་བརླབས་པ་དང་། ཐམས་ཅད་དུ་རྒྱལ་བ་དང་།
en: It becomes an abode of the tathāgatas, continually blessed by all victors.

source: དེ་བཞིན་དུ་ལུང་བསྟན་པའི་སའི་ཕྱོགས་དེར་གང་གཱའི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་སྙེད་ཀྱི་སངས་རྒྱས་རྣམས་བཞུགས་པ་དེར་རིག་སྔགས་འཆང་གིས་གང་དུ་བདུག་སྤོས་ཀྱིས་བདུགས་པས་རྡོ་རྗེ་འཆང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་རྣམས་དང་།
en: It has been prophesied that a thousand million billion buddhas, as numerous as the grains of sand in the Gaṅgā river, will reside at places where this incense is burned.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་བཅས། བཞོན་པ་དང་བཅས་པ་དང་། རྟག་ཏུ་རི་གངས་ལྡན་དང་། དེ་བཞིན་དུ་ནོར་བུ་བཟང་པོ་དང་། ལྔས་རྩེན་དང་། གང་བ་བཟང་པོ་དང་། ཀི་ལཱི་ཀཱི་ལ་དང་། གནོད་སྦྱིན་ཆེན་པོ་ཡང་དག་ཤེས་དང་། མི་ལ་ཞོན་པ་དང་། སངས་རྒྱས་སྟོབས་དང་། སྟོབས་པོ་ཆེ་དང་། སྒྲ་སྒོ་སྐྱོང་དང་། ན་ད་ཀཱུ་པེ་ར་དང་། རབ་འཇོམས་དང་།
en: Vajradhara, along with hundreds of thousands of millions of vidyādharas, will reside there, as will the Four Great Kings with their armies and chariots.

source: ཛྱ་ཊ་བ་ཀ་དང་། སྟོབས་ཀྱི་ལྷ་དང་། རྫུ་འཕྲུལ་ཆེན་པོ་སྟེ་འདི་རྣམས་སྡེ་དང་བཅས། དཔུང་དང་བཅས། བཞོན་པ་དང་བཅས་པས་ཉིན་མཚན་རྟག་ཏུ་གནས་ནས་དེ་བཞིན་ཉིད་དུ་སྲུང་བར་བྱེད་པར་བྱེད་དོ།
en: Maṇibhadra and Pāñcika from the lofty peaks of the snowy Himālayas, Pūrṇabhadra, Kelikila, the great yakṣa known as Naravāhana, the powerful Buddhabala, Mahābala, Gavākṣapātin, Navakūpara, Prabhañjana, Aṭavaka, and Baladeva, together with their armies and chariots, will also remain there at all times, day and night, guarding and protecting the vidyā holder. “

source: །བདག་གི་དཔལ་ས་གསུམ་གྱི་ལྷ་མོ་རྟག་ཏུ་མཆོད་པར་བྱེད་དོ།
en: Śrī, the goddess of the three worlds, should always be offered this incense in worship.

source: །རྟག་དུ་ས་གཞི་གང་དུ་བདུག་པ་རབ་ཏུ་བདུག་པར་བྱ་སྟེ། རྡོ་རྗེ་འཛིན་པ་དང་། དེ་བཞིན་ཉིད་དུ་གསང་བ་བ་དང་བཅས་པ་དང་། ཆོས་འཛིན་པ་ལ་མཁས་པ་རྣམས་རྟག་ཏུ་སྲུང་བར་བྱེད་ཅིང་། དེ་བཞིན་ཉིད་དུ་ཚངས་པ་དང་། དྲག་པོ་ལྟའི་བུ་རྣམས་དང་བཅས་པ་དང་། དེ་བཞིན་དུ་ཁྱབ་འཇུག་དང་། ལྷའི་རིས་སུམ་ཅུ་རྩ་གཉིས་པོ་ཐམས་ཅད་དུ་དུས་རྟག་ཏུ་ཡང་སྲུང་བར་བྱེད་དོ། །ཟླ་བ་དང་། ཉི་མ་དང་། དེ་བཞིན་ཉིད་སྒྲ་གཅན་དང་། རྒྱུ་སྐར་དང་།
en: The place on earth where this incense is burned is a divine place where Vajradhara, the skilled upholder of the Dharma, attended by guhyakas, always offers his protection.

source: སྐར་མའི་ཚོགས་དང་། མཚན་མོའི་ལྷ་རྣམས་ཀྱིས་དུས་རྟག་ཏུ་སྲུང་བར་བྱེད་དོ། །འཇིགས་མ་དང་། དཔལ་མོ་དང་། དུང་ཅན་མའི་ལྷ་རྣམས་དང་། དབྱངས་ཅན་མ་དང་།
en: Indra with the gods Brahmā and Rudra and all the thirty-two groups of gods will give constant protection there, as will Candra, Sūrya, Rāhu, the nakṣatras, the stellar constellations, and the deities of the night.

source: ས་འཛིན་གྱི་ལྷ་རྣམས་དང་། ཆུ་ལྷ་དང་། ལྗོན་པ་དང་། ནགས་ཀྱི་རྩེ་མོའི་ལྷ་དང་། རིའི་ལྷ་དང་། ཆུ་ཀླུང་དང་། ལྟེང་ཀའི་ལྷ་དང་། གཤིན་རྗེ་དང་། ཆུའི་ལྷ་དང་། ལུས་ངན་གྱི་ལྷ་དང་། གཞོན་ནུའི་ལྷ་དང་། ལྷའི་དྲང་སྲོང་བདག་ཉིད་ཆེ་བ་དང་། ལྟེང་ཀའི་ལྷ་དང་། ཆུ་ཀླུང་དང་།
en: The goddesses Bhīmā, Śrī, Śaṅkhinī, and Sarasvatī, the earth deities, the water deities, the chief deities of forests and trees, the mountain deities, the river deities, the deities of water reservoirs, the gods headed by Yama, Varuṇa, Kubera, and Kumāra, the noble ṛṣis, the male and female deities of the lakes, and the asuras will all give protection there and remain standing by day and night.

source: ལྟེང་ཀ་དང་། ལྷ་མ་ཡིན་དང་བཅས་པའི་ལྷ་རྣམས་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། དེ་བཞིན་དུ་ལྷ་རྣམས་ཀྱིས་རྟག་ཏུ་སྲུང་བར་བྱེད་དོ།
en: These deities are always connected to the places where this incense is burned. “

source: །རྟག་ཏུ་རྗེས་སུ་འབྲང་ཞིང་། ཉིན་མཚན་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་རྗེས་སུ་འབྲང་སྟེ། སའི་ཕྱོགས་གང་དུ་བདུག་སྤོས་འདིས་བདུགས་པའི་ས་ཕྱོགས་སུ་རྟག་ཏུ་ལྷའི་གནས་སུ་བྱིན་གྱིས་བརླབས་སོ། །འཇིག་རྟེན་དབང་ཕྱུག་དང་།
en: The places on earth where this incense is burned become abodes of gods and are ever blessed by them.

source: མགོན་པོ་དང་། བླ་མ་དང་། རྣམ་པར་འདྲེན་པ་དང་། འཇིག་རྟེན་གྱི་སྐྱབས་དང་། མཆོག་སྦྱིན་པར་དེ་བཞིན་ཉིད་དུ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་གནས་སོ།
en: The lokeśvara boon-granting protector of the world, the teacher, the guide, and the savior of people, is also continually present where this best of incense is burned.

source: །གནས་དེར་བདུག་སྤོས་གང་ཡིན་པ་དེ་དག་གིས་མཆོག་ཏུ་བདུག་པར་བྱའོ། །དྲི་མནམས་པ་ཙམ་གྱིས་མྱུར་དུ་སངས་རྒྱས་ཉིད་ཐོབ་བོ་ཞེས་སོ།
en: By merely smelling its fragrance, the vidyā holder will swiftly attain buddhahood. “

source: །སེམས་ཅན་ཀུན་ལ་ཕན་དོན་ཕྱིར། །སྡུག་བསྔལ་ཐམས་ཅད་ལྡོག་བྱེད་པའི། །རྫས་ཀྱི་མིང་རྣམས་བཤད་བྱ་ཡི། །ལྷ་དང་མི་རྣམས་མཉན་པར་གྱིས། །ཨ་ག་རུ་དང་རྒྱ་སྤོས་ཉིད། །དེ་བཞིན་ཙནྡན་སེར་མོར་བཅས། །སྤྲྀ་ཀ་ཉིད་དང་གི་ཝང་དང་། །ཀུན་ཏུ་རུ་བཅས་མ་ཧེའི་མིག །རོ་དང་སྲ་རྩི་པོག་ཉིད་དང་། །དེ་བཞིན་གུར་གུམ་ན་ལནྡ། །ཨ་རུ་ར་བཅས་དཔལ་བསྐོར་བ། །སཱ་མ་ཀཾ་དང་སྤང་སྤོས་བཅས། །པྲི་ཡང་ཀུ་བཅས་ཏུ་རུ་སྐ། །ཀ་ཡསྠ་དང་བ་ཡསྠ། །ན་མེ་རུ་དང་གླ་སྒང་བཅས།
en: For the benefit and well-being of all beings and in order to eradicate all suffering, I will now name its ingredients, so please listen, gods and humans!

source: །རུ་རྟ་ཨ་ག་རུ་ནག་ཉིད། །ག་པུར་དང་ནི་གླ་རྩི་ཉིད། །ལངྐ་གསེར་ཤིང་འབྲས་བུ་དང་། །ཨརྒའི་འོ་མ་གསེར་འོ་མ། །སྣུ་ཧའི་འོ་མ་ཉིད་དང་ནི། །ཐོད་པ་སྐལ་བ་ལྡན་ཉིད་དང་། །སོ་མ་རཱ་ཛ་ཁྱབ་འཇུག་གནོན། །ཤིང་དགའ་རྒྱལ་དང་རྣམ་རྒྱལ་ཉིད། །ནཱ་ཀུ་ལཱི་དྲི་ནཱ་ཀུ་ལཱི། །ཚངས་པའི་བུ་དང་ཀུ་མུ་དང་། །པདྨའི་ཆུ་བ་སྦྲང་རྩི་དང་། །བུ་རམ་དཀར་པོའི་ཁུ་བ་དང་།
en: They are agarwood, crepe jasmine, a handful of sandalwood, fenugreek, bovine bezoar, mahiṣākṣa, olibanum, rasa, white dammar, saffron, nalada, pine resin, yellow myrobalan, sāmaka, spikenard, olibanum, beautyberry, kayasthā, vayasthā, nameru, nut grass, costus, black agarwood, camphor, musk, laṅga, purging cotton, the sap of giant milkweed, the sap of kana, the sap of common milk hedge, kapāla, viṣṇukrānta, purple fleabane, snakeroot, jayā, vijayā, ichneumon plant, gandhanākulī, brahmaputrā, water lily, lotus stalk, honey, white sugar, and molasses syrup.

source: །འདི་རྣམས་ལྷན་ཅིག་སྦྱར་བ་ཡི། །བདུག་པའི་མཆོག་འདི་བསྒྲུབ་པར་བྱ། །མཁས་པས་ལེགས་པར་ཁྲུས་བྱས་ཏེ། །གཙང་མས་གཙང་མའི་གོས་བགོས་ཤིང་།
en: The supreme incense will be produced by combining these ingredients. “

source: །ཟླ་བ་ཉ་འམ་བཅུ་བཞི་ལ། །བཅུ་གསུམ་པའམ་ཚེས་བརྒྱད་ལ།
en: The ingredients should only be combined on either the fifteenth—the day of the full moon—or on the fourteenth, the thirteenth, or the eighth day of the lunar fortnight.

source: །རྟག་ཏུ་སྦྱར་བྱ་ཉིན་མཚན་གཟུང་། །སྔགས་ལ་མཁས་པས་བདུག་སྤོས་འདི།
en: The skilled vidyā holder should maintain ritual purity day and night, wear clean clothes, and bathe thoroughly.

source: །སོ་སོ་སོ་སོར་ཀུན་སྦྱར་ནས། ཕྱག་རྒྱ་དཀྱིལ་འཁོར་གསང་སྔགས་དང་། །མེ་ཏོག་བདུག་སྤོས་དྲི་རྒྱ་ཆེན། །མཆོད་པའི་ཆོ་ག་འདི་ཡིས་དང་།
en: After combining the ingredients one at a time, he should skillfully employ the mantras, mudrās, and the maṇḍala while making appropriate use of flowers, incense, and fragrances.

source: །གཏོར་མའི་ལས་ལ་མཁས་པ་དང་། །མཆོད་ཡོན་སྣོད་ནི་གང་བ་དང་། །མགོ་ལའང་དྲི་དང་ཏིལ་མར་གྱི།
en: The skilled vidyā holder should perform the bali ritual as part of the worship procedure.

source: །མར་མེ་ལེགས་གྲུ་གནས་སུ་ནི།
en: Bowls filled with argha water should be placed in the front, lamps should be lit, and everything should be well arranged for the rite.

source: །ལེགས་སྦས་གཙང་མར་གནས་དེ་སྒྲུབ། །ལེགས་སྦས་གཙང་མར་གནས་པ་ཡི། །སློབ་མ་མཆོག་གི་གྲོགས་ཀྱིས་ནི། །དོན་ཡོད་ཞགས་པའི་སྤྱན་སྔ་རུ།
en: The rite should be performed in a place that is well hidden and clean, with an attendant who is the vidyā holder’s best disciple. “

source: །འདུག་ནས་ཡོངས་སུ་དག་པའི་ལུས། །སྡོམ་དང་བྱམས་པའི་སེམས་གཞག་ནས། །སེམས་ཅན་ཀུན་ལ་སྙིང་རྗེའི་བདག །སངས་རྒྱས་རྗེས་སུ་དྲན་སྒོམ་ཞིང་། །གསང་སྔགས་བཟླས་པ་མཆོག་གྱིས་ཤིག །
en: The vidyā holder, his body immaculately clean and controlled and his mind singularly focused on thoughts of loving kindness and compassion for all beings, should sit opposite an image of Amoghapāśa, contemplate the buddhas, and recite the mantra with all his heart.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་དམིགས་ཏེ་འཇིག་རྟེན་དབང་ཕྱུག་གི་ཞལ་ནས་བྱུང་བ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་ཁྲོ་བོའི་རྒྱལ་པོ་སྟོང་རྩ་བརྒྱད་དོན་ཡོད་པ་གྲུབ་པའི་བརྒྱ་རྩ་བརྒྱད་ཚིག་དང་ཡི་གེ་ཤིན་ཏུ་གསལ་བར་བཟླས་ནས་དོན་ཡོད་པའི་རྒྱ་མཚོའི་ནོར་བུ་པདྨ་ལ་རྣམ་པར་བལྟ་བའི་དཔལ་དྲི་མ་མེད་པ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྟོང་ཕྲག་བཅུ་བཟླས་ཏེ།
en: Focusing on all the tathāgatas while facing the Lokeśvara, he should recite the heart mantra of Amoghapāśa the full one thousand and eight times, the mantra of Krodharāja the full one thousand and eight times, and the mantra of Amoghasiddhi one hundred and eight times. Then, clearly pronouncing the letters and syllables, the vidyā holder should recite the heart mantra of Amoghapāśa called immaculately pure Śrī with the gaze of the Holder of the Jewel and the Lotus who is like the ocean of amogha the full ten thousand times.

source: དེ་ནས་གསང་སྔགས་འདི་སྟོང་ཕྲག་བརྒྱ་བཟླས་སོ།
en: When finished, he should recite the following mantra one hundred thousand times: [196] “Oṁ, you are the gaze of all the tathāgatas, the amogha essence!

source: །ཨོཾ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བ་ལོ་ཀི་ཏེ་ཨ་མོ་གྷ་ཧྲྀ་ད་ཡན།
en: Move, move, O most compassionate one!

source: ཙ་ར་ཙ་ར་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ་སཱ་དྷ་ཡ་ཧཱུཾ།
en: Hūṁ! Consecrate me!

source: ཨ་བྷི་ཥིཉྩ་ཡ་ཨ་མོ་གྷ་བཱ་ཤ་ཧ་སྟེ་སྭཱ་ཧཱ།
en: The holder of the unfailing noose, svāhā! “

source: དེ་ནས་གསང་སྔགས་བཟླས་བརྗོད་བྱས་ཏེ་མཉམ་པར་གཞག་ལ།
en: He should recite this mantra while deeply focused and perform all the parts of the ritual skillfully.

source: ལས་ཐམས་ཅད་ལ་མཁས་པས་བདུག་སྤོས་ཀྱི་མཆོག་ལ་བཟླས་པ་ཙམ་གྱི་མོད་ལ་བདུག་སྤོས་ཀྱི་རྒྱལ་པོ་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: As soon as he has finished reciting it, this best of incense will possess the blessing of all the tathāgatas.

source: །དོན་ཡོད་པའི་ཞགས་པ་སྣང་བ་རྒྱ་ཆེ་བ་ནོར་བུ་ཆེན་པོའི་སྤྲིན་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་གཟིགས་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མཆོག་སྦྱིན་པའི་འཁོར་ལོས་སྒྱུར་བ་ཞེས་བྱ་བའི་བདུག་པའི་རྒྱལ་པོ་ཡིན་ཏེ།
en: The king of incense, once it is blessed, will be called great cloud of the widespread light of Amoghapāśa that is as pure as a jewel. This king of incense will also be called noble emperor who grants the boons of Avalokiteśvara and possesses the gaze of each of the tathāgatas.

source: ཐོག་མར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་སྔགས་འདི་ལན་བདུན་བཟླས་ཏེ་བདུག་པ་དབུལ་བར་བྱའོ།
en: The vidyā holder should first offer the incense to all the tathāgatas while reciting this mantra seven times: [197] “Oṁ, O great torrent of the gaze of all the tathāgatas!

source: །ཨོཾ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བ་ལོ་ཀི་ཏེ་མ་ཧཱ་ཨ་མོ་གྷ་ཛ་ཡ་ཛ་ཡ་སྭཱ་ཧཱ།
en: Conquer, conquer! Svāhā! “

source: དེའི་འོག་ཏུ་བདག་རང་ལ་བདུགས་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ།
en: The vidyā holder should then fumigate himself to obtain a blessing from all the tathāgatas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཆོག་སྦྱིན་པ་བདུགས་པ་ཙམ་གྱི་མོད་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྐུ་སྟོན་པར་འགྱུར་རོ།
en: As soon as he fumigates himself, the great bodhisattva Noble Avalokiteśvara will appear to him and grant him boons.

source: །དགེ་སྦྱོང་དང་བྲམ་ཟེའི་གཟུགས་ཀྱིས་དེ་དང་ལྷན་ཅིག་སྨྲ་བར་བྱེད་དེ།
en: He will appear in the form of a brahmin monk and speak courteously.

source: གང་ལ་སྨྲས་པ་དང་གང་ལ་གཏམ་བྱས་པ་དེ་ཐམས་ཅད་ཚེ་འདི་ལ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: Everything he says will come true in reality.

source: །དེའི་འོག་ཏུ་མཚན་མོ་རང་གི་གཟུགས་སྟོན་པར་འགྱུར་ཞིང་མཆོག་སྦྱིན་པར་མཛད་དོ།
en: Later, at night, he will appear in his real form and grant the vidyā holder every boon.

source: །དོན་ཡོད་པའི་ཞགས་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར། འཇིགས་པ་ཆེན་པོ་བརྒྱད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: The vidyā holder will obtain amogha knowledge and will be freed from the eight great fears.

source: སྔོན་གྱི་སྒྲིབ་པ་དང་སྡིག་པ་དམྱལ་བའི་ཚོར་བ་མྱོང་བར་འགྱུར་བ་ཟད་ཅིང་མཐར་ཐུག་པར་འགྱུར་རོ།
en: All his previously accumulated obscurations and nonvirtue that would otherwise lead to rebirth in hell will diminish and disappear completely. “

source: །གང་དག་གི་ལུས་ལ་བདུགས་པ་ཙམ་དང་མཐོང་བ་ཙམ་གྱི་མོད་ལ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: All those who see the body of a person who has been fumigated will fall and remain under their thrall as soon as they see it.

source: །ཡུལ་འཁོར་དང་གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་ལྗོངས་དང་རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དང་། བློན་པོ་དང་། བློན་པོ་ཆེན་པོ་དང་། བཀྲབས་པ་དང་།
en: The kings and their kingdoms that include cities, towns, and villages, as well as their harems, retinues, ministers, brahmin advisers, and priests, will all fall and remain under that person’s thrall.

source: བྲམ་ཟེ་མདུན་ན་འདོན་དང་བཅས་པ་དབང་དུ་འགྱུར་ཞིང་ཐམས་ཅད་བགྱི་བ་ཅི་མཆིས་ཞེས་བྱ་བ་བྱེད་པར་འགྱུར་རོ།
en: They will all become their servants, eager to follow their orders.

source: །རིགས་བཞིའི་འཇིག་རྟེན་དབང་དུ་འགྱུར་རོ།
en: The people of the four castes will also remain under their thrall. “

source: །ཚེས་བཅུ་བཞི་དང་བཅྭ་ལྔ་དང་ཚེས་བརྒྱད་ལ་ཁྲུས་ལེགས་པར་བྱ་སྟེ། གོས་གཙང་མ་བགོས་ལ་བ་ལས་བྱུང་བ་ལྔས་བྱུགས་པས་ཁྱིམ་གྱི་ཕུགས་སུ་དཀྱིལ་འཁོར་བྱས་ལ། མེ་ཏོག་དང་མཆོད་ཡོན་གྱི་སྣོད་གཞག་པར་བྱ། གཏོར་མ་དཀར་པོ་ཉེ་བར་གཞག་པར་བྱ།
en: On the fourteenth, the fifteenth, or the eighth day of the lunar fortnight, the vidyā holder—thoroughly bathed, wearing clean clothes, and anointed with the five products of the cow—should prepare a maṇḍala in a prominent place, arranging flowers, bowls with argha water, and a bali consisting of ‘white’ foods.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་དམིགས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་དམིགས་ཏེ། ཕྱོགས་བཞིར་ཕྱག་བྱས་ལ་བདུག་པའི་རྒྱལ་པོ་འདིས་བདུག་པར་བྱས་ན།
en: He should then bow in the four cardinal directions and burn the king of incense while thinking of all the tathāgatas and bodhisattvas.

source: བདུགས་པ་ཙམ་གྱི་མོད་ལ་ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱི་རྡུལ་ཕྲ་མོ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་གང་བ་ལ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱ་ལ་བདུག་པའི་སྤྲིན་འཁྲིགས་པ་ལྷའི་སྤོས་ཀྱིས་བསྒོས་པ་མི་མཉམ་པ་དང་མཉམ་པའི་བདུག་སྤོས་ཆེན་པོ་ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། གོར་ཤིརྵ་དང་། ཏ་མ་ལའི་ལོ་མ་དང་། བདུག་སྤོས་མང་པོ་ནམ་མཁའི་ངོས་ཁེབས་པས་མཆོད་པར་འགྱུར་རོ།
en: By merely burning the incense, all the hundreds of thousands of millions of billions of tathāgatas—as numerous of the grains of sand in ten Gaṅgā rivers, dwelling in each and every buddha field in the infinity of space in the ten directions where the atoms in each buddha field are in turn filled with tathāgata abodes that are impossible to count—will be worshiped with this incomparably great incense, together with their bodhisattva retinues, and perfumed by its vapor clouds spreading through the sky and filling its expanse with the scent of uragasāra sandalwood, gośīrṣa sandalwood, and tamāla leaves. “

source: །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྣམས་དང་སུམ་ཅུ་རྩ་གསུམ་ན་གནས་པའི་ལྷ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་འོག་མིན་གྱི་གནས་ན་གནས་པའི་ལྷའི་བར་དུ་ཐམས་ཅད་བདུག་པའི་དྲིས་རབ་ཏུ་དགའ་བར་འགྱུར་རོ། །རྒྱུ་སྐར་དང་།
en: All the gods who dwell in the abodes of Thirty-Three, the gods Śakra, Brahmā, Viṣṇu, and Maheśvara, and the gods as far as the realm of Akaniṣṭha will be exhilarated by the scent of the incense, as will the nakṣatras, the multitudes of stars, Sūrya, Candra, and the months.

source: སྐར་མའི་ཚོགས་དང་། ཉི་མ་དང་ཟླ་བ་ཐམས་ཅད་དགའ་བར་འགྱུར་ཏེ། འདི་ལ་ཐེ་ཚོམ་མི་བྱ་ཞིང་ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱའོ། །སྐད་ཆེན་པོས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་པ་བྱས་ན།
en: One should not have any doubt about this or give rise to any qualms, but one should recite the heart mantra of Amoghapāśa with a loud voice.

source: དེས་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པར་འགྱུར་ཞིང་རིག་སྔགས་འཆང་དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་རློབ་པར་འགྱུར།
en: The tathāgatas who dwell in the buddha fields everywhere will say ‘Good!’ and will bestow upon the vidyā holder the blessing of the tathāgatas.

source: དུས་ཀུན་ཏུ་དགོངས་པར་འགྱུར། ཡང་དང་ཡང་དུ་གཟིགས་པའི་ཕྱིར་བྱོན་པར་འགྱུར་རོ།
en: They will always keep him in their hearts and will appear to him again and again. “

source: །བདེ་བ་ཅན་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཐུགས་རབ་ཏུ་དགྱེས་པར་འགྱུར། རིག་སྔགས་འཆང་ལ་དོན་ཡོད་པ་ཆེན་པོའི་དངོས་གྲུབ་སྩོལ་བར་མཛད་གཟིགས་བཞེད་པར་འགྱུར་རོ།
en: All the bodhisattvas who dwell in Sukhāvatī, the buddha field of the Tathāgata Amitāyus—among whom the most prominent are the noble bodhisattvas Avalokiteśvara and Mahā­sthāma­prāpta—will be overjoyed and will grant the vidyā holder the supreme amogha accomplishment.

source: །ཀླུ་ཐམས་ཅད་ལ་བདུགས་པ་ཙམ་གྱིས་དབང་དུ་འགྱུར་ཞིང་ཧ་ཅང་ཆར་ཆེས་ན་གཅོད་པར་བྱེད་ཅིང་ཆར་མི་འབབ་ན་འབེབས་པར་བྱེད་དོ།
en: They will appear to him whenever he wants to see them. All nāgas will be enthralled as soon as the incense reaches them. They will stop excessive rain and send rain in the event of a drought.

source: །རླུང་དང་སེར་བ་དང་སྤྲིན་ཐམས་ཅད་གཅོད་པར་བྱེད་བདུགས་པ་ཙམ་གྱིས་གདོན་ཐམས་ཅད་འཇིག་པར་བྱེད་བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་ཕྱོགས་བཅུར་དཔག་ཚད་སྟོང་དུ་འབྲོས་པར་འགྱུར།
en: They will dispel any storm clouds that bring strong winds and hail. “All grahas will disappear as soon as the incense reaches them, and all vighnas and vināyakas will flee one thousand leagues into the ten directions.

source: མ་མོའི་གནས་སུ་བདུགས་ན་རླུང་དང་སེར་བ་དང་སྤྲིན་ཐམས་ཅད་གཅོད་པར་བྱེད་མ་མོའི་ཚོགས་དང་ནག་པོ་ཆེན་པོ་ལ་སོགས་པ་འགུགས་པར་འགྱུར་ཞིང་དབང་དུ་གྱུར་ནས་འདུག་པར་འགྱུར་བྱ་བ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: When a place haunted by mātṛs is fumigated, the hosts of mātṛs headed by Mahākāla will be summoned and fall under the vidyā holder’s thrall.

source: །གཡུལ་འགྱེད་པའི་ཚེ་བདུགས་ན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པའི་དཔུང་ལས་རྒྱལ་བར་འགྱུར།
en: They will all become his servants, eager to carry out orders. If the vidyā holder burns the incense and enters the thick of a battle, he will defeat the army with its four divisions.

source: ཐམས་ཅད་དུ་བདུགས་པ་ཙམ་གྱིས་རྒྱལ་བར་འགྱུར།
en: By merely burning the incense, he will obtain complete victory.

source: ཐམས་ཅད་དུ་སྦྱར་བར་བྱས་ན་ཀུན་ཏུ་གྲུབ་པ་ཆེན་པོར་འགྱུར་རོ།
en: Whatever purpose it is employed for, this incense will bring great success. “

source: །བདུག་པའི་ཆོ་གའོ།། །།
en: This concludes the incense procedures. “

source: འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་གཅིག་པ། དེ་ནས་རིག་སྔགས་འཆང་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཐིག་ལེ་བྱ་བ་དང་། གདོང་བཀྲུ་བ་དང་ལུས་བསྐུ་བ་བྱས་ན་ཡ་ལད་དང་། གོ་ཆ་བགོས་པ་དང་འདྲ་བར་འགྱུར་བ་བཤད་པར་བགྱི་ཡིས་བཅོམ་ལྡན་འདས་གསན་དུ་གསོལ།
en: Now will I teach, for the benefit of all vidyā holders, the procedures for applying a bindi, a face wash, and a bodily unguent that offer the protection of a coat of mail or cuirass.

source: དོན་ཡོད་པའི་ནོར་བུ་རྒྱ་ཆེན་པོ་རྡོ་རྗེའི་ཞགས་པ་ཞེས་བྱ་བའི་ནོར་བུ་གང་སྦྱོར་བ་བྱས་པ་ཙམ་གྱིས་ཐམས་ཅད་འགྲུབ་པ་བླ་ན་མེད་པ་མཁས་པས་མཛོད་སྤུ་རྣམས་སུ་ཐིག་ལེ་བྱས་ན་ཚོགས་ཀྱི་ནང་དང་སྐྱེ་བོ་མང་པོའི་ནང་དང་ཚོགས་པའི་ནང་དང་དགེ་འདུན་གྱི་ནང་དང་དེ་བཞིན་དུ་རིགས་བྱེད་ཀྱི་ཚོགས་བཞིའི་ནང་དུ་སྐར་མའི་ཚོགས་ཀྱི་ནང་དུ་ཟླ་བ་ཚེས་པ་བཞིན་དུ་མཛེས་ཤིང་འཇིགས་པ་མེད་དོ།
en: Please listen, Lord, about this great amogha jewel, the jewel of his vajra noose, which, as soon as it is used, brings the supreme accomplishment. A wise vidyā holder who marks the space between his eyebrows with the bindi while in a group or a crowd of people, in a midst of a gathering, in a congregation of monks, or among scholars versed in the four Vedas will shine like the new autumn moon among the multitude of stars.

source: །ལྷ་རྣམས་ཐམས་ཅད་ཡ་མཚན་སྐྱེ། །དྲག་པོ་ཡི་ནི་ཅོད་པན་འཆང་། འཇིག་རྟེན་མགོན་པོའི་གཡས་ཀྱི་དབུའི། །དབུ་རྒྱན་རྩེ་ཕྲན་ཟླ་ཚེས་བཞིན།
en: The gods will all be filled with wonder at his radiance, which will match the diadem of Rudra or even the diadem of the lord of the world in his form of Dakṣiṇamūrti, whose diadem is the crescent moon. “

source: །གདོང་བཀྲུ་བ་ནི་མཆོག་ཡིན་ནོ། །ཟླ་བ་ཉ་བའི་འོད་དང་མཚུངས།
en: The supreme procedure of washing of the face will make it as radiant as the moon.

source: །སྨིན་མ་རྣ་བ་དཔྲལ་བ་དང་། །པདྨ་དཀར་ཤམ་ཤིན་ཏུ་འཇམ། །མིག་གཉིས་ཨུཏྤལ་སྔོན་པོ་འདྲ།
en: The vidyā holder’s brow, ears, and forehead will become as white and smooth as a lotus, and his eyes will resemble blue water lilies.

source: །སེམས་ཅན་ཐམས་ཅད་དགའ་བས་བལྟ། །དགའ་ཞིང་རྟག་ཏུ་ཚིག་བཙན་འགྱུར། །དེ་ཡི་མིག་གིས་གང་མཐོང་བ།
en: All beings will enjoy looking at him, and his speech will be pleasant to hear.

source: །ཐམས་ཅད་དབང་དུ་གྱུར་པར་འགྱུར།
en: All those who see him will inevitably fall under his thrall. “

source: །སྐྱེས་པ་དག་ལ་བསྐུ་བྱས་ན། །རྟག་ཏུ་རིག་སྨྲ་བློ་ཆེ་ཞིང་།
en: The person anointed with the unguent will always recite the vidyā in a high-minded way.

source: །རྟག་ཏུ་ཡ་ལ་གོ་བགོས་པའི། །འཇིགས་པ་མེད་པའི་ལུས་སུ་འགྱུར། །འབྱུང་པོ་རྣམས་ནི་མི་བཟོད་ཅིང་། །གནོད་སྦྱིན་འབྱུང་པོ་གསང་བ་པས། །རྟག་ཏུ་ཐུབ་པར་མི་འགྱུར་རོ།
en: A skilled vidyā holder who always fastens this coat of mail around his body will become unassailable by bhūtas, yakṣas, rākṣasas, and guhyakas.

source: །སྟོབས་ཆེན་ཕ་རོལ་གནོན་པ་དང་། །རྟག་ཏུ་སྲེད་མེད་སྟོབས་ལྡན་ཞིང་།
en: In all cases he will be invincible in battle because of his great strength and valor.

source: །གླང་ཆེན་སྟོབས་ཀྱི་སྟོབས་ལྡན་འགྱུར།
en: He will always have the strength of Nārāyaṇa or of one thousand elephants.

source: །ལྷ་རྣམས་འདར་ནི་ཡེད་ཡེད་ཅིང་། །ཀླུ་རྣམས་མཚོན་སྐྲག་པར་བྱེད།
en: The gods will tremble, and the nāgas in the ocean will be terrified.

source: །གལ་ཏེ་རིག་སྔགས་སྨྲ་བ་ཡིས། །རེག་ན་རི་རབ་ལྷུན་པོ་ཡང་།
en: If the vidyā holder touches Mount Sumeru while reciting the vidyā, it will instantly quake.

source: །གཡོ་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད།
en: There can be no doubt about this. “

source: །རྟག་ཏུ་སྲེད་མེད་སྟོབས་ལྡན་ཞིང་། །སྟོབས་དང་གཟུགས་དང་རྩལ་ལྡན་འགྱུར།
en: Strong as Nārāyaṇa, the vidyā holder will always possess a similar strength, beauty, and valor.

source: །ནོར་བུ་རྒྱལ་པོ་བླ་ན་མེད། །འདི་ནི་ཐོས་པ་ཙམ་གྱིས་ཀྱང་། །སྡིག་པ་ཀུན་ལས་ངེས་གྲོལ་ཞིང་། །དུག་རྣམས་ཐམས་ཅད་འཇོམས་པར་བྱེད། །དཔལ་དང་སྐལ་བཟང་རྟག་ཐོབ་འགྱུར།
en: By merely holding this supreme king of jewels in his hand, he will be saved from the consequences of all his wrongdoings, and his negativity will be destroyed.

source: །གང་གི་ལག་ཏུ་ཐོགས་གྱུར་པ། །སྒྲིབ་བ་ཀུན་ལས་ངེས་གྲོལ་ཞིང་། །དེ་བཞིན་འཇིག་རྟེན་དགའ་བར་འགྱུར། །དེ་ནི་དེ་བཞིན་གཤེགས་ཀུན་གྱི། །ཐུགས་སྐྱེས་གསུང་སྐྱེས་སྲས་སུ་འགྱུར།
en: Whoever takes this jewel in their hand will always obtain good fortune and splendor, will be freed from all their obscurations, will be loved by everybody, and will be regarded by all the tathāgatas as their own firstborn.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག །བླ་མ་རྟག་ཏུ་རྗེས་འབྲང་ཞིང་། །རིག་སྔགས་སྨྲ་བ་དབུགས་འབྱུང་ཕྱིར། །དེ་བཞིན་དུ་ནི་བསྲུང་བ་དང་།
en: Noble Avalokiteśvara will always stand by to give them comfort and encouragement and to protect the reciter of vidyā.

source: །རྟག་ཏུ་མཆོག་ནི་སྦྱིན་པར་འགྱུར། །འཇིག་རྟེན་མགོན་པོ་ཐུབ་ཆེན་གྱི།
en: The great lokeśvara sage will always be present in the vidyā holder’s home and grant him boons. “

source: །བསོད་ནམས་ཕུང་པོ་ཆེན་པོ་འཐོབ།
en: The vidyā holder who wears this jewel will accumulate a great amount of merit.
